In [3]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

In [4]:
# import -> 실제 수행, 재실행시는 reload(모듈명) 
%cd

C:\Users\HJKIM

In [6]:
#Series 
object1 = Series([4,5,-3,6])
object1

0    4
1    5
2   -3
3    6
dtype: int64

In [7]:
object1.values

array([ 4,  5, -3,  6], dtype=int64)

In [8]:
object1.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [10]:
object2 = Series([4,5,-3,6], index=['d','a','c','b'])

In [11]:
object2

d    4
a    5
c   -3
b    6
dtype: int64

In [12]:
object2[['a','d']]

a    5
d    4
dtype: int64

In [13]:
object2[object2> 0]

d    4
a    5
b    6
dtype: int64

In [14]:
object2 * 3

d    12
a    15
c    -9
b    18
dtype: int64

In [15]:
np.exp(object2)

d     54.598150
a    148.413159
c      0.049787
b    403.428793
dtype: float64

In [16]:
'b' in object2

True

In [17]:
serialData = {'a':35000,'b':5000, 'c':13000}

In [18]:
serialData

{'a': 35000, 'b': 5000, 'c': 13000}

In [20]:
object2 = Series(serialData)
object2

a    35000
b     5000
c    13000
dtype: int64

In [21]:
pd.isnull(object2)

a    False
b    False
c    False
dtype: bool

In [22]:
pd.notnull(object2)

a    True
b    True
c    True
dtype: bool

In [25]:
# DataFrame
data = {'state':['oh','oh','oh','Nev','Nev'],
       'year':[2000,2001,2002,2001,2002],
       'population':[1.5, 1.7, 2.3, 2.9, 3.2]}
data

{'population': [1.5, 1.7, 2.3, 2.9, 3.2],
 'state': ['oh', 'oh', 'oh', 'Nev', 'Nev'],
 'year': [2000, 2001, 2002, 2001, 2002]}

In [26]:
frame = DataFrame(data) 
frame

   population state  year
0         1.5    oh  2000
1         1.7    oh  2001
2         2.3    oh  2002
3         2.9   Nev  2001
4         3.2   Nev  2002

In [27]:
DataFrame(data, columns=['year','state','population'])

   year state  population
0  2000    oh         1.5
1  2001    oh         1.7
2  2002    oh         2.3
3  2001   Nev         2.9
4  2002   Nev         3.2

In [28]:
frame2 = DataFrame(data, columns=['year','state','population','debt'], index=['one','two','three','four','five'])

In [29]:
frame2

       year state  population debt
one    2000    oh         1.5  NaN
two    2001    oh         1.7  NaN
three  2002    oh         2.3  NaN
four   2001   Nev         2.9  NaN
five   2002   Nev         3.2  NaN

In [30]:
frame2.columns

Index([u'year', u'state', u'population', u'debt'], dtype='object')

In [31]:
frame2['state']

one       oh
two       oh
three     oh
four     Nev
five     Nev
Name: state, dtype: object

In [32]:
frame2.ix['three']

year          2002
state           oh
population     2.3
debt           NaN
Name: three, dtype: object

In [34]:
frame2['debt']=15  #missing data적용
frame2

       year state  population  debt
one    2000    oh         1.5    15
two    2001    oh         1.7    15
three  2002    oh         2.3    15
four   2001   Nev         2.9    15
five   2002   Nev         3.2    15

In [35]:
frame2['debt'] = np.arange(5.)
frame2

       year state  population  debt
one    2000    oh         1.5     0
two    2001    oh         1.7     1
three  2002    oh         2.3     2
four   2001   Nev         2.9     3
five   2002   Nev         3.2     4

In [38]:
frame2['estern'] = frame2.state=='oh'
frame2

       year state  population  debt estern
one    2000    oh         1.5     0   True
two    2001    oh         1.7     1   True
three  2002    oh         2.3     2   True
four   2001   Nev         2.9     3  False
five   2002   Nev         3.2     4  False

In [39]:
del frame2['estern']

In [40]:
frame2

       year state  population  debt
one    2000    oh         1.5     0
two    2001    oh         1.7     1
three  2002    oh         2.3     2
four   2001   Nev         2.9     3
five   2002   Nev         3.2     4

In [47]:
population = {'Nev':{2001:2.4, 2002:2.9},'Ohio':{2000:1.2,2001:1.5,2002:3.5}}

In [48]:
population

{'Nev': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.2, 2001: 1.5, 2002: 3.5}}

In [49]:
frame3 = DataFrame(population)
frame3

      Nev  Ohio
2000  NaN   1.2
2001  2.4   1.5
2002  2.9   3.5

In [50]:
frame3.T

      2000  2001  2002
Nev    NaN   2.4   2.9
Ohio   1.2   1.5   3.5

In [52]:
obj = Series([4.4, 6.7,-5.5, 3.5], index=['d','b','a','c'])
obj

d    4.4
b    6.7
a   -5.5
c    3.5
dtype: float64

In [56]:
obj2 = obj.reindex(['a','b','c','d','e'], fill_value=0)
obj2

a   -5.5
b    6.7
c    3.5
d    4.4
e    0.0
dtype: float64

In [57]:
obj3 = Series(['blue','purple','yellow'], index=[0,2,4])
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [58]:
obj = Series(np.arange(5.), index=['a','b','c','d','e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: float64

In [60]:
new_obj = obj.drop('c')
new_obj

a    0
b    1
d    3
e    4
dtype: float64